pruebas/results/2025-11-10_22-52-33/S2_1_proxy_ro_t8.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 912.04 qps: 14600.95 (r/w/o: 12776.07/0.00/1824.88) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 938.98 qps: 15023.12 (r/w/o: 13145.25/0.00/1877.86) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 970.50 qps: 15525.44 (r/w/o: 13584.45/0.00/1940.99) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            395136
        write:                           0
        other:                           56448
        total:                           451584
    transactions:                        28224  (940.46 per sec.)
    queries:                             451584 (15047.30 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          30.0099s
    total number of events:              28224

Latency (ms):
         min:                                    5.33
         avg:                                    8.50
         max:                                   44.29
         95th percentile:                       11.24
         sum:                               239955.44

Threads fairness:
    events (avg/stddev):           3528.0000/370.83
    execution time (avg/stddev):   29.9944/0.00